app/Controllers/Follow.php

INSERT INTO `followers` (`user_id`, `page_id`, `followed_by`) VALUES (0, '1', '2')
---
            'followed_by'   => empty($userdata)?0:$userdata['data']->id
        ];
        $model = new FollowerModel();
        $registered = $model->save($data);