app/Controllers/Page.php

    public function index()
    {
        $model = new PageModel();
        $data = $model->findAll();
---
SELECT *
FROM `pages`

            'created_by'    => empty($userdata)?0:$userdata['data']->id
        ];
        $model = new PageModel();
        $registered = $model->save($data);
---
INSERT INTO `pages` (`page_name`, `created_by`) VALUES ('Test Page', '2')