app/Controllers/Post.php

INSERT INTO `posts` (`post_content`, `page_id`, `created_by`) VALUES ('Test Post 13', 0, '2')
---
            'created_by'    => empty($userdata)?0:$userdata['data']->id
        ];
        $model = new PostModel();
        $registered = $model->save($data);