app/Controllers/Register.php

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`) VALUES ('Abu', 'Raihan', 'raihan@gmail.com', '$2y$10$uBlaPNIyb4uIdAfyrCDNw.M8O31.W7T07pEthFZ6pNvd5E6m44OoO')
---
    public function index()
    {
        helper(['form']);
        $rules = [
            'first_name' => 'required|min_length[2]|max_length[100]',
            'last_name' => 'required|min_length[2]|max_length[100]',
            'email' => 'required|valid_email|is_unique[users.email]|max_length[100]',
            'password' => 'required|min_length[6]|max_length[100]',
            'confpassword' => 'matches[password]'
        ];
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $data = [
            'first_name'     => $this->request->getVar('first_name'),
            'last_name'     => $this->request->getVar('last_name'),
            'email'     => $this->request->getVar('email'),
            'password'  => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT)
        ];
        $model = new UserModel();
        $registered = $model->save($data);